content/projects/pokedex/scrape_all_pokemon_data.org
#+title: Scrape All Pokemon Data
#+date: <2023-10-03 Tue>
#+tags: :r:web-scraping:
#+catgory: pokedex
#+excerpt:  Scrape main stats and evolution data to Pokedex table.
#+PROPERTY: header-args R :session *R*

Now that we know how to build the initial Pokedex table and then fill out stats for each Pokemon in the initial table, we can build out the full Pokedex!

* Load Libraries

Again, we'll primarily use the =rvest= package, along with some other libraries for common functions to help get the Pokedex table.

#+BEGIN_SRC R

  # Load packages
  library(rvest)
  library(dplyr)
  library(tidyr)
  library(tibble)
  library(stringr)

#+END_SRC

* Read Initial Pokedex

Just like before, let's read a table consisting of only Pokemon names, numbers, and the URLs to access each Pokemon's page.

#+BEGIN_SRC R

  fetch_pokedex_data <- function() {

    # Set the URL to fetch data from
    url <- "https://pokemondb.net/pokedex/national"

    # Read the body from the page
    body <- url %>% read_html() %>% html_nodes("body")

    # Get the info cards for each Pokemon
    infocards <- html_nodes(body, "span.infocard-lg-data.text-muted")

    # Fetch the Pokemon numbers
    numbers <- infocards %>%
      html_element("small") %>%
      html_text()

    # Fetch the Pokemon names
    names <- infocards %>%
      html_element("a") %>%
      html_text()

    # Fetch the Pokemon URLs
    urls <- infocards %>%
      html_element("a") %>%
      html_attr("href")
    urls <- paste0("https://pokemondb.net", urls)

    # Create tibble for Pokedex
    data_tbl <- tibble(numbers, names, urls) %>%
      rename(Number = numbers, Name = names, URLs = urls)
    data_tbl$Number <- substring(data_tbl$Number, 2) %>% as.numeric()

    return(data_tbl)

  }

  pokedex_tbl <- fetch_pokedex_data()

#+END_SRC

| Number | Name       | URLs                                         |
|--------+------------+----------------------------------------------|
| 1      | Bulbasaur  | [[https://pokemondb.net/pokedex/bulbasaur]]  |
| 2      | Ivysaur    | [[https://pokemondb.net/pokedex/ivysaur]]    |
| 3      | Venusaur   | [[https://pokemondb.net/pokedex/venusaur]]   |
| 4      | Charmander | [[https://pokemondb.net/pokedex/charmander]] |
| 5      | Charmeleon | [[https://pokemondb.net/pokedex/charmeleon]] |

