projects/pokedex/scrape_all_pokemon_data.html
<!-- Generated from 9b14faa on 2023-12-01 @ 14:59 with Emacs 27.1 (Org mode 9.3) -->
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"/><meta author="J. Dylan White"/><meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/code.css"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/site.css"/><title>Scrape All Pokemon Data - J. Dylan White</title></head><body><header class="site-header"><div class="container"><div class="site-title"><a class="site-name" href="/">J. Dylan White</a> </div></div><div class="site-masthead"><div class="container"><nav class="nav"><a class="nav-link" href="/">Home</a> <a class="nav-link" href="/projects/">Projects</a> <a class="nav-link" href="/dotfiles/">Dotfiles</a> </nav></div></div></header><div class="container"><div class="site-post"><h1 class="site-post-title">Scrape All Pokemon Data</h1><p class="site-post-meta">October  3, 2023</p><div id="content"><p>
Now that we know how to build the initial Pokedex table and then fill out stats for each Pokemon in the initial table, we can build out the full Pokedex!
</p>

<h2><a id="load-libraries" class="anchor" href="#load-libraries">¶</a>Load Libraries</h2><div class="outline-text-2" id="text-orgf2c5409">
<p>
Again, we&rsquo;ll primarily use the <code>rvest</code> package, along with some other libraries for common functions to help get the Pokedex table.
</p>

<pre><span class="org-comment-delimiter"># </span><span class="org-comment">Load packages</span>
<span class="org-ess-modifiers">library</span>(rvest)
<span class="org-ess-modifiers">library</span>(dplyr)
<span class="org-ess-modifiers">library</span>(tidyr)
<span class="org-ess-modifiers">library</span>(tibble)
<span class="org-ess-modifiers">library</span>(stringr)</pre>
</div>

<h2><a id="read-initial-pokedex" class="anchor" href="#read-initial-pokedex">¶</a>Read Initial Pokedex</h2><div class="outline-text-2" id="text-org0997e72">
<p>
Just like before, let&rsquo;s read a table consisting of only Pokemon names, numbers, and the URLs to access each Pokemon&rsquo;s page.
</p>

<pre><span class="org-function-name">fetch_pokedex_data</span> <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-keyword">function</span>() {

  <span class="org-comment-delimiter"># </span><span class="org-comment">Set the URL to fetch data from</span>
  url <span class="org-ess-assignment">&lt;-</span> <span class="org-string">"https://pokemondb.net/pokedex/national"</span>

  <span class="org-comment-delimiter"># </span><span class="org-comment">Read the body from the page</span>
  body <span class="org-ess-assignment">&lt;-</span> url <span class="org-ess-XopX">%&gt;%</span> read_html() <span class="org-ess-XopX">%&gt;%</span> html_nodes(<span class="org-string">"body"</span>)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Get the info cards for each Pokemon</span>
  infocards <span class="org-ess-assignment">&lt;-</span> html_nodes(body, <span class="org-string">"span.infocard-lg-data.text-muted"</span>)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Fetch the Pokemon numbers</span>
  numbers <span class="org-ess-assignment">&lt;-</span> infocards <span class="org-ess-XopX">%&gt;%</span>
    html_element(<span class="org-string">"small"</span>) <span class="org-ess-XopX">%&gt;%</span>
    html_text()

  <span class="org-comment-delimiter"># </span><span class="org-comment">Fetch the Pokemon names</span>
  names <span class="org-ess-assignment">&lt;-</span> infocards <span class="org-ess-XopX">%&gt;%</span>
    html_element(<span class="org-string">"a"</span>) <span class="org-ess-XopX">%&gt;%</span>
    html_text()

  <span class="org-comment-delimiter"># </span><span class="org-comment">Fetch the Pokemon URLs</span>
  urls <span class="org-ess-assignment">&lt;-</span> infocards <span class="org-ess-XopX">%&gt;%</span>
    html_element(<span class="org-string">"a"</span>) <span class="org-ess-XopX">%&gt;%</span>
    html_attr(<span class="org-string">"href"</span>)
  urls <span class="org-ess-assignment">&lt;-</span> paste0(<span class="org-string">"https://pokemondb.net"</span>, urls)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Create tibble for Pokedex</span>
  data_tbl <span class="org-ess-assignment">&lt;-</span> tibble(numbers, names, urls) <span class="org-ess-XopX">%&gt;%</span>
    rename(Number = numbers, Name = names, URLs = urls)
  data_tbl$Number <span class="org-ess-assignment">&lt;-</span> substring(data_tbl$Number, 2) <span class="org-ess-XopX">%&gt;%</span> as.numeric()

  <span class="org-ess-keyword">return</span>(data_tbl)

}

pokedex_tbl <span class="org-ess-assignment">&lt;-</span> fetch_pokedex_data()</pre>

<div class="table-wrapper"><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">URLs</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Bulbasaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/bulbasaur">https://pokemondb.net/pokedex/bulbasaur</a></td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Ivysaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/ivysaur">https://pokemondb.net/pokedex/ivysaur</a></td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Venusaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/venusaur">https://pokemondb.net/pokedex/venusaur</a></td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Charmander</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/charmander">https://pokemondb.net/pokedex/charmander</a></td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Charmeleon</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/charmeleon">https://pokemondb.net/pokedex/charmeleon</a></td>
</tr>
</tbody>
</table></div>
</div>
