projects/pokedex/scrape_all_pokemon_data.html

<h2><a id="fetch-pokemon-data" class="anchor" href="#fetch-pokemon-data">¶</a>Fetch Pokemon Data</h2><div class="outline-text-2" id="text-fetch-pokemon-data">
<p>
Loop through each Pokedex row and append additional information, such as height, battle stats, and evolution data. This will take some time, since we&rsquo;re scraping <i>all</i> Pokemon data, and waiting one second between function calls to be avoid the naughty list.
</p>

<pre><span class="org-function-name">fetch_pokemon_data</span> <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-keyword">function</span>(row) {

  <span class="org-comment-delimiter"># </span><span class="org-comment">Fetch the name and URL from the Pokedex data</span>
  name <span class="org-ess-assignment">&lt;-</span> row[2]
  url <span class="org-ess-assignment">&lt;-</span> row[3]
  print(paste0(name,<span class="org-string">" "</span>,row[1]))

  <span class="org-comment-delimiter"># </span><span class="org-comment">Read the body from the page</span>
  body <span class="org-ess-assignment">&lt;-</span> url <span class="org-ess-XopX">%&gt;%</span> read_html() <span class="org-ess-XopX">%&gt;%</span> html_nodes(<span class="org-string">"body"</span>)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Get the tables with the vital information</span>
  vitals_tables <span class="org-ess-assignment">&lt;-</span> html_nodes(body, <span class="org-string">"table.vitals-table"</span>)
  main_table <span class="org-ess-assignment">&lt;-</span> html_table(vitals_tables[1])[[1]]
  stats_table <span class="org-ess-assignment">&lt;-</span> html_table(vitals_tables[4])[[1]]

  <span class="org-comment-delimiter"># </span><span class="org-comment">Function to help us turn the first row of our tibble into the header</span>
  <span class="org-function-name">header_from_row</span> <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-keyword">function</span>(df) {
    names(df) <span class="org-ess-assignment">&lt;-</span> as.character(unlist(df[1, ]))
    df[-1, ]
  }

  <span class="org-comment-delimiter"># </span><span class="org-comment">Get the types, species, height, and weight from the table</span>
  main_tbl <span class="org-ess-assignment">&lt;-</span> main_table <span class="org-ess-XopX">%&gt;%</span>
    t <span class="org-ess-XopX">%&gt;%</span>
    as_tibble <span class="org-ess-XopX">%&gt;%</span>
    header_from_row <span class="org-ess-XopX">%&gt;%</span>
    select(c(<span class="org-string">"Type"</span>, <span class="org-string">"Species"</span>, <span class="org-string">"Height"</span>, <span class="org-string">"Weight"</span>))

  <span class="org-comment-delimiter"># </span><span class="org-comment">Get stats columns</span>
  stats_tbl <span class="org-ess-assignment">&lt;-</span> stats_table <span class="org-ess-XopX">%&gt;%</span>
    select(c(<span class="org-string">"X1"</span>, <span class="org-string">"X2"</span>)) <span class="org-ess-XopX">%&gt;%</span>
    t <span class="org-ess-XopX">%&gt;%</span>
    as_tibble <span class="org-ess-XopX">%&gt;%</span>
    header_from_row

  <span class="org-comment-delimiter"># </span><span class="org-comment">Merge the data</span>
  data_tbl <span class="org-ess-assignment">&lt;-</span> cbind(main_tbl, stats_tbl)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Clean up the types by breaking them into different columns</span>
  num_types <span class="org-ess-assignment">&lt;-</span> data_tbl$Type <span class="org-ess-XopX">%&gt;%</span> strsplit(<span class="org-string">" "</span>) <span class="org-ess-XopX">%&gt;%</span> unlist <span class="org-ess-XopX">%&gt;%</span> length
  col_names <span class="org-ess-assignment">&lt;-</span> paste(<span class="org-string">"Type"</span>, c(1:num_types))
  data_tbl <span class="org-ess-assignment">&lt;-</span> data_tbl <span class="org-ess-XopX">%&gt;%</span>
    separate(col = <span class="org-string">"Type"</span>, into = col_names)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Ensure columns are fixed. Types sometimes only has 1, but can be up to 3.</span>
  cols <span class="org-ess-assignment">&lt;-</span> c(
    `Type 1` = <span class="org-ess-constant">NA_character_</span>,
    `Type 2` = <span class="org-ess-constant">NA_character_</span>,
    `Type 3` = <span class="org-ess-constant">NA_character_</span>
  )
  data_tbl <span class="org-ess-assignment">&lt;-</span> add_column(data_tbl,
                         !!!cols[setdiff(names(cols), names(data_tbl))])

  <span class="org-comment-delimiter"># </span><span class="org-comment">Look for evolution information</span>
  evo_node <span class="org-ess-assignment">&lt;-</span> html_nodes(body, <span class="org-string">"div.infocard-list-evo"</span>)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Check to see if there was any evolution information</span>
  has_evo <span class="org-ess-assignment">&lt;-</span> length(evo_node) &gt;= 1

  <span class="org-comment-delimiter"># </span><span class="org-comment">If there was evolution information</span>
  <span class="org-ess-keyword">if</span> (has_evo) {

    <span class="org-comment-delimiter"># </span><span class="org-comment">Get the list of evolutions</span>
    evo_list <span class="org-ess-assignment">&lt;-</span> evo_node <span class="org-ess-XopX">%&gt;%</span> html_nodes(<span class="org-string">"a.ent-name"</span>) <span class="org-ess-XopX">%&gt;%</span> html_text

    <span class="org-comment-delimiter"># </span><span class="org-comment">Get the maximum number of evolutions for this Pokemon's evolution chain</span>
    max_evo <span class="org-ess-assignment">&lt;-</span> length(unique(evo_list))

    <span class="org-comment-delimiter"># </span><span class="org-comment">Find out where in the evolution chain this Pokemon sits</span>
    evo_place <span class="org-ess-assignment">&lt;-</span> which(tolower(evo_list) == tolower(name))[1]

    <span class="org-comment-delimiter"># </span><span class="org-comment">Calculate an evolution index, how far to max evolution the Pokemon is</span>
    evo_index <span class="org-ess-assignment">&lt;-</span> round(as.double(evo_place) / as.double(max_evo), 2)

    <span class="org-comment-delimiter"># </span><span class="org-comment">Otherwise, assume there is not evolution of this Pokemon</span>
  } <span class="org-ess-keyword">else</span> {

    <span class="org-comment-delimiter"># </span><span class="org-comment">Set the evolution information to NA</span>
    max_evo <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-constant">NA_integer_</span>
    evo_place <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-constant">NA_integer_</span>
    evo_index <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-constant">NA_integer_</span>

  }

  <span class="org-comment-delimiter"># </span><span class="org-comment">Append evolution information to the data tibble</span>
  evo_list <span class="org-ess-assignment">&lt;-</span> c(
    `Has Evolution` = has_evo,
    `Evolution Place` = evo_place,
    `Maximum Evolution Count` = max_evo,
    `Evolution Index` = evo_index
  )
  evo_tbl <span class="org-ess-assignment">&lt;-</span> evo_list <span class="org-ess-XopX">%&gt;%</span>
    t <span class="org-ess-XopX">%&gt;%</span>
    as_tibble
  data_tbl <span class="org-ess-assignment">&lt;-</span> cbind(data_tbl, evo_tbl)

  <span class="org-comment-delimiter"># </span><span class="org-comment">Add a sleep timer to not overload the system</span>
  Sys.sleep(1)

  <span class="org-ess-keyword">return</span>(data_tbl)

}

<span class="org-comment-delimiter"># </span><span class="org-comment">Get Pokemon data</span>
pokemon_tbl <span class="org-ess-assignment">&lt;-</span> apply(pokedex_tbl, 1, fetch_pokemon_data) <span class="org-ess-XopX">%&gt;%</span>
  bind_rows()

<span class="org-comment-delimiter"># </span><span class="org-comment">Merge pokedex_tbl and pokemon_tbl</span>
pokemon_tbl <span class="org-ess-assignment">&lt;-</span> cbind(pokedex_tbl, pokemon_tbl)</pre>

<div class="table-wrapper"><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">URLs</th>
<th scope="col" class="org-left">Type 1</th>
<th scope="col" class="org-left">Type 2</th>
<th scope="col" class="org-left">Species</th>
<th scope="col" class="org-left">Height</th>
<th scope="col" class="org-left">Weight</th>
<th scope="col" class="org-right">HP</th>
<th scope="col" class="org-right">Attack</th>
<th scope="col" class="org-right">Defense</th>
<th scope="col" class="org-right">Sp. Atk</th>
<th scope="col" class="org-right">Sp. Def</th>
<th scope="col" class="org-right">Speed</th>
<th scope="col" class="org-right">Total</th>
<th scope="col" class="org-left">Type 3</th>
<th scope="col" class="org-right">Has Evolution</th>
<th scope="col" class="org-right">Evolution Place</th>
<th scope="col" class="org-right">Maximum Evolution Count</th>
<th scope="col" class="org-right">Evolution Index</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Bulbasaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/bulbasaur">https://pokemondb.net/pokedex/bulbasaur</a></td>
<td class="org-left">Grass</td>
<td class="org-left">Poison</td>
<td class="org-left">Seed Pokémon</td>
<td class="org-left">0.7 m (2′04″)</td>
<td class="org-left">6.9 kg (15.2 lbs)</td>
<td class="org-right">45</td>
<td class="org-right">49</td>
<td class="org-right">49</td>
<td class="org-right">65</td>
<td class="org-right">65</td>
<td class="org-right">45</td>
<td class="org-right">318</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0.33</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Ivysaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/ivysaur">https://pokemondb.net/pokedex/ivysaur</a></td>
<td class="org-left">Grass</td>
<td class="org-left">Poison</td>
<td class="org-left">Seed Pokémon</td>
<td class="org-left">1.0 m (3′03″)</td>
<td class="org-left">13.0 kg (28.7 lbs)</td>
<td class="org-right">60</td>
<td class="org-right">62</td>
<td class="org-right">63</td>
<td class="org-right">80</td>
<td class="org-right">80</td>
<td class="org-right">60</td>
<td class="org-right">405</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">0.67</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Venusaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/venusaur">https://pokemondb.net/pokedex/venusaur</a></td>
<td class="org-left">Grass</td>
<td class="org-left">Poison</td>
<td class="org-left">Seed Pokémon</td>
<td class="org-left">2.0 m (6′07″)</td>
<td class="org-left">100.0 kg (220.5 lbs)</td>
<td class="org-right">80</td>
<td class="org-right">82</td>
<td class="org-right">83</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">80</td>
<td class="org-right">525</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">1.00</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Charmander</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/charmander">https://pokemondb.net/pokedex/charmander</a></td>
<td class="org-left">Fire</td>
<td class="org-left">NA</td>
<td class="org-left">Lizard Pokémon</td>
<td class="org-left">0.6 m (2′00″)</td>
<td class="org-left">8.5 kg (18.7 lbs)</td>
<td class="org-right">39</td>
<td class="org-right">52</td>
<td class="org-right">43</td>
<td class="org-right">60</td>
<td class="org-right">50</td>
<td class="org-right">65</td>
<td class="org-right">309</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0.33</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Charmeleon</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/charmeleon">https://pokemondb.net/pokedex/charmeleon</a></td>
<td class="org-left">Fire</td>
<td class="org-left">NA</td>
<td class="org-left">Flame Pokémon</td>
<td class="org-left">1.1 m (3′07″)</td>
<td class="org-left">19.0 kg (41.9 lbs)</td>
<td class="org-right">58</td>
<td class="org-right">64</td>
<td class="org-right">58</td>
<td class="org-right">80</td>
<td class="org-right">65</td>
<td class="org-right">80</td>
<td class="org-right">405</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">0.67</td>
</tr>
</tbody>
</table></div>
</div>
