content/projects/pokedex/scrape_all_pokemon_data.org
* Clean Data

Clean up the Height and Weight fields to just have the metric units.

#+BEGIN_SRC R

  clean_pokemon_data <- function(data_tbl) {

    # Clean up Height field to only show meters
    data_tbl$Height <- data_tbl$Height %>%
      str_extract("\\d+\\.*\\d*") %>%
      as.numeric

    # Clean up Weight field to only show kilograms
    data_tbl$Weight <- data_tbl$Weight %>%
      str_extract("\\d+\\.*\\d*") %>%
      as.numeric

    return(data_tbl)

  }

  pokemon_tbl <- clean_pokemon_data(pokemon_tbl)

#+END_SRC

| Number | Name       | URLs                                         | Type 1 | Type 2 | Species        | Height | Weight | HP | Attack | Defense | Sp. Atk | Sp. Def | Speed | Total | Type 3 | Has Evolution | Evolution Place | Maximum Evolution Count | Evolution Index |
|--------+------------+----------------------------------------------+--------+--------+----------------+--------+--------+----+--------+---------+---------+---------+-------+-------+--------+---------------+-----------------+-------------------------+-----------------|
| 1      | Bulbasaur  | [[https://pokemondb.net/pokedex/bulbasaur]]  | Grass  | Poison | Seed Pokémon   | 0.7    | 6.9    | 45 | 49     | 49      | 65      | 65      | 45    | 318   | NA     | 1             | 1               | 3                       | 0.33            |
| 2      | Ivysaur    | [[https://pokemondb.net/pokedex/ivysaur]]    | Grass  | Poison | Seed Pokémon   | 1.0    | 13.0   | 60 | 62     | 63      | 80      | 80      | 60    | 405   | NA     | 1             | 2               | 3                       | 0.67            |
| 3      | Venusaur   | [[https://pokemondb.net/pokedex/venusaur]]   | Grass  | Poison | Seed Pokémon   | 2.0    | 100.0  | 80 | 82     | 83      | 100     | 100     | 80    | 525   | NA     | 1             | 3               | 3                       | 1.00            |
| 4      | Charmander | [[https://pokemondb.net/pokedex/charmander]] | Fire   | NA     | Lizard Pokémon | 0.6    | 8.5    | 39 | 52     | 43      | 60      | 50      | 65    | 309   | NA     | 1             | 1               | 3                       | 0.33            |
| 5      | Charmeleon | [[https://pokemondb.net/pokedex/charmeleon]] | Fire   | NA     | Flame Pokémon  | 1.1    | 19.0   | 58 | 64     | 58      | 80      | 65      | 80    | 405   | NA     | 1             | 2               | 3                       | 0.67            |

* Write Pokedex Data to Output File

Finally, write this data out to a CSV.

#+BEGIN_SRC R

  # Write data to CSV
  write.table(pokemon_tbl, "~/Projects/pokedex/data/pokedex.csv",
              sep = ",", row.names = FALSE)

#+END_SRC
