projects/pokedex/scrape_all_pokemon_data.html

<h2><a id="clean-data" class="anchor" href="#clean-data">¶</a>Clean Data</h2><div class="outline-text-2" id="text-org19c178a">
<p>
Clean up the Height and Weight fields to just have the metric units.
</p>

<pre><span class="org-function-name">clean_pokemon_data</span> <span class="org-ess-assignment">&lt;-</span> <span class="org-ess-keyword">function</span>(data_tbl) {

  <span class="org-comment-delimiter"># </span><span class="org-comment">Clean up Height field to only show meters</span>
  data_tbl$Height <span class="org-ess-assignment">&lt;-</span> data_tbl$Height <span class="org-ess-XopX">%&gt;%</span>
    str_extract(<span class="org-string">"\\d+\\.*\\d*"</span>) <span class="org-ess-XopX">%&gt;%</span>
    as.numeric

  <span class="org-comment-delimiter"># </span><span class="org-comment">Clean up Weight field to only show kilograms</span>
  data_tbl$Weight <span class="org-ess-assignment">&lt;-</span> data_tbl$Weight <span class="org-ess-XopX">%&gt;%</span>
    str_extract(<span class="org-string">"\\d+\\.*\\d*"</span>) <span class="org-ess-XopX">%&gt;%</span>
    as.numeric

  <span class="org-ess-keyword">return</span>(data_tbl)

}

pokemon_tbl <span class="org-ess-assignment">&lt;-</span> clean_pokemon_data(pokemon_tbl)</pre>

<div class="table-wrapper"><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">URLs</th>
<th scope="col" class="org-left">Type 1</th>
<th scope="col" class="org-left">Type 2</th>
<th scope="col" class="org-left">Species</th>
<th scope="col" class="org-right">Height</th>
<th scope="col" class="org-right">Weight</th>
<th scope="col" class="org-right">HP</th>
<th scope="col" class="org-right">Attack</th>
<th scope="col" class="org-right">Defense</th>
<th scope="col" class="org-right">Sp. Atk</th>
<th scope="col" class="org-right">Sp. Def</th>
<th scope="col" class="org-right">Speed</th>
<th scope="col" class="org-right">Total</th>
<th scope="col" class="org-left">Type 3</th>
<th scope="col" class="org-right">Has Evolution</th>
<th scope="col" class="org-right">Evolution Place</th>
<th scope="col" class="org-right">Maximum Evolution Count</th>
<th scope="col" class="org-right">Evolution Index</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Bulbasaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/bulbasaur">https://pokemondb.net/pokedex/bulbasaur</a></td>
<td class="org-left">Grass</td>
<td class="org-left">Poison</td>
<td class="org-left">Seed Pokémon</td>
<td class="org-right">0.7</td>
<td class="org-right">6.9</td>
<td class="org-right">45</td>
<td class="org-right">49</td>
<td class="org-right">49</td>
<td class="org-right">65</td>
<td class="org-right">65</td>
<td class="org-right">45</td>
<td class="org-right">318</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0.33</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Ivysaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/ivysaur">https://pokemondb.net/pokedex/ivysaur</a></td>
<td class="org-left">Grass</td>
<td class="org-left">Poison</td>
<td class="org-left">Seed Pokémon</td>
<td class="org-right">1.0</td>
<td class="org-right">13.0</td>
<td class="org-right">60</td>
<td class="org-right">62</td>
<td class="org-right">63</td>
<td class="org-right">80</td>
<td class="org-right">80</td>
<td class="org-right">60</td>
<td class="org-right">405</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">0.67</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Venusaur</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/venusaur">https://pokemondb.net/pokedex/venusaur</a></td>
<td class="org-left">Grass</td>
<td class="org-left">Poison</td>
<td class="org-left">Seed Pokémon</td>
<td class="org-right">2.0</td>
<td class="org-right">100.0</td>
<td class="org-right">80</td>
<td class="org-right">82</td>
<td class="org-right">83</td>
<td class="org-right">100</td>
<td class="org-right">100</td>
<td class="org-right">80</td>
<td class="org-right">525</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">1.00</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Charmander</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/charmander">https://pokemondb.net/pokedex/charmander</a></td>
<td class="org-left">Fire</td>
<td class="org-left">NA</td>
<td class="org-left">Lizard Pokémon</td>
<td class="org-right">0.6</td>
<td class="org-right">8.5</td>
<td class="org-right">39</td>
<td class="org-right">52</td>
<td class="org-right">43</td>
<td class="org-right">60</td>
<td class="org-right">50</td>
<td class="org-right">65</td>
<td class="org-right">309</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0.33</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Charmeleon</td>
<td class="org-left"><a href="https://pokemondb.net/pokedex/charmeleon">https://pokemondb.net/pokedex/charmeleon</a></td>
<td class="org-left">Fire</td>
<td class="org-left">NA</td>
<td class="org-left">Flame Pokémon</td>
<td class="org-right">1.1</td>
<td class="org-right">19.0</td>
<td class="org-right">58</td>
<td class="org-right">64</td>
<td class="org-right">58</td>
<td class="org-right">80</td>
<td class="org-right">65</td>
<td class="org-right">80</td>
<td class="org-right">405</td>
<td class="org-left">NA</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">0.67</td>
</tr>
</tbody>
</table></div>
</div>

<h2><a id="write-pokedex-data-to-output-file" class="anchor" href="#write-pokedex-data-to-output-file">¶</a>Write Pokedex Data to Output File</h2><div class="outline-text-2" id="text-org91e8342">
<p>
Finally, write this data out to a CSV.
</p>

<pre><span class="org-comment-delimiter"># </span><span class="org-comment">Write data to CSV</span>
write.table(pokemon_tbl, <span class="org-string">"~/Projects/pokedex/data/pokedex.csv"</span>,
            sep = <span class="org-string">","</span>, row.names = <span class="org-ess-constant">FALSE</span>)</pre>
</div>
</div></div></div><footer class="site-footer"><div class="container"><div class="row"><div class="column"><p><a href="https://github.com/jdylanwhite">GitHub</a> · <a href="https://www.linkedin.com/in/jdylanwhite5">LinkedIn</a> · <a href="mailto:jdylanwhite5@gmail.com">Email</a></p></div><div class="column align-right"><p><a href="https://github.com/jdylanwhite/jdylanwhite.github.io">Site Source</a></p></div></div></div></footer></body></html>
